{
  "header": "TECH STACK",
  "description": "Uwielbiam poznawać i testować nowe technologie. Poniższe należą do moich ulubionych ale nie ograniczam się do nich.",
  "techs": {  
    "core": [
      "Przeważnie pracuję w Javascript, to zdecydowanie mój najmocniejszy język. Ostatnio w projektach zacząłem wykorzystywać dodatkowo Typescript.",
      "Jakość i utrzymywalność kodu jest dla mnie bardzo ważna. Piszę testy jednostkowe i integracyjne używając bibliotek Jest i Enzyme. Zawsze używam systemu kontroli wersji GIT oraz dbam o dokumentacje.",
      "Potrafię sprawnie posługiwać się menadżerami NPM i Yarn, oraz skonfigurować Webpacka."
    ],
    "frontend": [
      "Moim głównym obszarem zainteresowań jest React. Wykorzystywałem go na wszystkie sposoby: CSR, SSR, Native. Staram się być na bierząco z dodawanymi funkcjonalnościami i popularnymi bibliotekami. np. Hooks, Suspense, Redux, i18n.",
      "W odniesieniu do designu, potrafię korzystać z szerokiego wachlarza opcji. Chociaż preferuję CSS-w-JS jak np. Styled-Components, to równie dobrze radze sobie z Sass i silnikami szablonów jak EJS. Zawsze staram się trzymać zasad sematycznego HTML5, Accessibility i konwencji BEM. "
    ],
    "backend": [
      "Moja wiedza z zakresu node.js, pozwala mi na pisanie wydajnych serwerów oraz rozwiązywanie kompleksowych problemów.", 
      "Sprawnie poruszam się we frameworkach Express i Apollo. Biegle programuje asynchronicznie oraz tworzę wydajne RESTful/GrapQL API.",
      "Opanowałem kluczowe aspekty Bezpieczeństwa Sieci. Pracowałem z popularnymi metodami Uwierzytelniania i Autoryzacji. Posiadam również wiedzę z zakresu budowy sieci i protokołów HTTP/HTTPS.", 
      "Jestem zaznajomiony z popularnymi wzorcami architektoniczymi: Monolith, MVC, SOA, Microservice, Serverless."
    ],
    "databases": [
      "W zależności od potrzeb jestem w stanie budować i utrzymywać bazy danych SQL jak i noSQL.",
      "Z nie relacyjnych baz danych najlepiej czuje się pracując w MongoDB + Mongoose. Dla baz relacyjnych używałem MySQL wraz z biblioteka Sequelize.", "Oprócz tego świetnie pracowało mi się z platformą Firebase."
    ],
    "other": []
  }
}